src/toir_cfe/src/Documents/торо_УстановкаАналоговНоменклатурыДляРемонтов/торо_УстановкаАналоговНоменклатурыДляРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="70713d91-cbcb-4e92-ac9f-a0a817d6e0ce">
  <name>торо_УстановкаАналоговНоменклатурыДляРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3941362c-26be-4fff-a565-63e2a4c4214a">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="34ec1fe8-0682-46e1-9881-f904b5468771">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="424f5519-312d-42a6-ac10-615c02711cf2">
    <name>УказаниеПоПрименению</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="26bac8ba-27be-488f-ba8f-9b81a02af2d2">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="59bb11af-2006-4299-a16c-2a763773be5f">
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6983a326-a9e9-4d7b-b740-6b3f76280b8c">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d2c92ace-8e7a-43f2-a392-285cbac3ad37">
    <name>НаправлениеОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f1ae0b5-4b90-4756-96fa-c5647a70a735">
    <name>СписокОбъектовРМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e8926b2-9f0c-491e-9210-4dda111cb257">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="afd8c838-4157-4908-a6bc-13e15246f203">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b968bd78-d9f7-4136-b7f5-27eb5b522e66">
    <name>проф_Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="909b34e1-9074-4194-945d-47599019dd04">
    <name>Аналоги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="516454eb-a002-4aa7-8e2d-4ae0f2cb11f7">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2d2125b4-e902-4499-8955-1cfbf0b37e03">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e5560730-2fd7-492d-80f3-ed2e8044197f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b1c2cab1-49ce-4f27-9ed4-59c15c3d370e">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="884799a4-d659-4fea-917e-798420697301">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2201f132-10ef-4ff7-9f15-83c61b78d683">
    <name>Материалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6ac84c55-480e-4ee8-b529-9b2a86b5b25b">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="84ac5858-07f7-4abb-a4c5-b59bbdff0e63">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b48b0cdc-05dd-409f-b3a0-8085af8ffa5f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="57210a28-5600-40dd-ad64-ebc75b73765a">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e502bc90-b43e-4dc6-ac08-9de107ff5d82">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a180ce65-2990-4b3d-80fc-83f6ef430224">
      <name>КлючСвязиТехКарта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_УстановкаАналоговНоменклатурыДляРемонтов/ManagerModule.bsl
#Область Проведение

&Вместо("ИнициализироватьДанныеДокумента")
Процедура проф_ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства)
	
	//++ Проф-ИТ, #288, Соловьев А.А., 31.10.2023
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Номенклатура КАК Материал,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Характеристика КАК ХарактеристикаМатериала,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Количество КАК КоличествоМатериала,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.КоличествоУпаковок КАК КоличествоУпаковокМатериала,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Упаковка КАК УпаковкаМатериала,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.КлючСвязиТехКарта КАК КлючСвязиТехКарта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Номенклатура КАК Аналог,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Характеристика КАК ХарактеристикаАналога,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Количество КАК КоличествоАналога,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.КоличествоУпаковок КАК КоличествоУпаковокАналога,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Упаковка КАК УпаковкаАналога,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втНоменклатураСАналогами
	|ИЗ
	|	Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов.Материалы КАК торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы,
	|	Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов.Аналоги КАК торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги
	|ГДЕ
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Ссылка = &Ссылка
	|	И торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Ссылка = &Ссылка
	|	И торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.НомерСтроки = торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Номенклатура,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Характеристика,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Количество,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.КоличествоУпаковок,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Упаковка,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.КлючСвязиТехКарта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Номенклатура,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Характеристика,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Количество,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.КоличествоУпаковок,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Упаковка,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Ссылка
	|ИЗ
	|	Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов.Материалы КАК торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы,
	|	Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов.Аналоги КАК торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги
	|ГДЕ
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Ссылка = &Ссылка
	|	И торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Ссылка = &Ссылка
	|	И торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.НомерСтроки = торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Организация КАК Организация,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ТехКарта КАК ТехКарта,
	|	ВЫБОР
	|		КОГДА торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ = ЗНАЧЕНИЕ(Справочник.торо_СписокОбъектовРегламентногоМероприятия.ПустаяСсылка)
	|			ТОГДА торо_УстановкаАналоговНоменклатурыДляРемонтов.ОбъектРемонта
	|		ИНАЧЕ торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ
	|	КОНЕЦ КАК ОбъектРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.НаправлениеОбъектаРемонта КАК НаправлениеОбъектаРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ КАК СписокОбъектовРМ,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ВидРемонта КАК ВидРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ДатаНачалаДействия КАК Период,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ДатаОкончанияДействия КАК ПериодЗавершения,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Подразделение КАК Подразделение,
	|	втНоменклатураСАналогами.Материал КАК Материал,
	|	втНоменклатураСАналогами.ХарактеристикаМатериала КАК ХарактеристикаМатериала,
	|	МАКСИМУМ(втНоменклатураСАналогами.КоличествоМатериала) КАК КоличествоМатериала,
	|	МАКСИМУМ(втНоменклатураСАналогами.КоличествоУпаковокМатериала) КАК КоличествоУпаковокМатериала,
	|	втНоменклатураСАналогами.УпаковкаМатериала КАК УпаковкаМатериала,
	|	втНоменклатураСАналогами.КлючСвязиТехКарта КАК КлючСвязиТехКарта,
	|	втНоменклатураСАналогами.Аналог КАК Аналог,
	|	втНоменклатураСАналогами.ХарактеристикаАналога КАК ХарактеристикаАналога,
	|	МАКСИМУМ(втНоменклатураСАналогами.КоличествоАналога) КАК КоличествоАналога,
	|	МАКСИМУМ(втНоменклатураСАналогами.КоличествоУпаковокАналога) КАК КоличествоУпаковокАналога,
	|	втНоменклатураСАналогами.УпаковкаАналога КАК УпаковкаАналога
	|ИЗ
	|	втНоменклатураСАналогами КАК втНоменклатураСАналогами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов КАК торо_УстановкаАналоговНоменклатурыДляРемонтов
	|		ПО втНоменклатураСАналогами.Ссылка = торо_УстановкаАналоговНоменклатурыДляРемонтов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Организация,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ТехКарта,
	|	ВЫБОР
	|		КОГДА торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ = ЗНАЧЕНИЕ(Справочник.торо_СписокОбъектовРегламентногоМероприятия.ПустаяСсылка)
	|			ТОГДА торо_УстановкаАналоговНоменклатурыДляРемонтов.ОбъектРемонта
	|		ИНАЧЕ торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ
	|	КОНЕЦ,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.НаправлениеОбъектаРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ВидРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ДатаНачалаДействия,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ДатаОкончанияДействия,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Подразделение,
	|	втНоменклатураСАналогами.Материал,
	|	втНоменклатураСАналогами.ХарактеристикаМатериала,
	|	втНоменклатураСАналогами.УпаковкаМатериала,
	|	втНоменклатураСАналогами.КлючСвязиТехКарта,
	|	втНоменклатураСАналогами.Аналог,
	|	втНоменклатураСАналогами.ХарактеристикаАналога,
	|	втНоменклатураСАналогами.УпаковкаАналога";
	
	Результат = Запрос.Выполнить();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаАналоговВПроизводстве", Результат.Выгрузить());
	//-- Проф-ИТ, #288, Соловьев А.А., 31.10.2023
	
КонецПроцедуры

#КонецОбласти
